#' ---
#' pagetitle: Возможности R для работы с пространственными данными
#' title: Возможности R для работы с пространственными данными
#' author: Никита Платонов (ИПЭЭ РАН)
#' date: "`r format(Sys.time(),'%Y-%m-%d %H:%M')`"
#' abstract: Для желающих сделать первые шаги в освоении R демонстрация основ работы с интерфейсом командной строки в R, позволяющей создавать скрипты и получать воспроизводимые результаты. Узнаете, как пространственные векторные и растровые данные могут попасть в R и как они выглядят в R. Попробуете сделать обработку, анализ и визуализацию пространственные данных
#' toc: true
#' ---
#'
#' # Вступление
#'
#' Планируется, что основные материалы для проведения мастер-класса появятся здесь к 27 сентября.
#' Предполагается, что некоторые дополнения могут быть внесены и в более поздний срок, но с учетом того, чтобы эти изменения не потребовали существенного заимоствования времени у мастер-класса.
#' Основной режим проведения мастер-класса - это копирование/вставка фрагмента кода, поэтому этот материал может быть использован дистанционными участниками.
#'
#' # Подготовка к мастер-классу.
#'
#' Не для всех операционных систем есть скомпилированные 
#'
#' ## Установка R
#'
#' + Установить R, например, [отсюда](https://cran.rstudio.com/)
#'
#' # Материалы
#'
#'
#' ## Пример
#'
#+
image(volcano)
